erp3l/src/Documents/ВыбытиеВекселей/ВыбытиеВекселей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыбытиеВекселей</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>InformationRegister.СтатусыАкцептаПереводныхВекселей</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>InformationRegister.ВерсииРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентКонтрагент</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиФакт</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВыбытиеВекселя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаНачисленияПроцентов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияНачисленияПроцентов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредусмотренПроцентныйДоход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетВзаиморасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыйИнструмент</name>
    <type>
      <types>CatalogRef.ЦенныеБумаги</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыйРезультат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаВекселя</name>
    <type>
      <types>EnumRef.ФормаВекселя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаУчета</name>
    <attributes>
      <name>ВидСчетаФИ</name>
      <type>
        <types>CatalogRef.ВидыСчетовФИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОпераций</name>
    <attributes>
      <name>ОперацияГрафика</name>
      <type>
        <types>CatalogRef.ОперацииГрафиковДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Catalogs/ОперацииГрафиковДоговоров/ОперацииГрафиковДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОперацииГрафиковДоговоров</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АккредитивВыданный</name>
      <description>Аккредитив выданный</description>
    </items>
    <items>
      <name>ЛизингПолученный</name>
      <description>Аренда, лизинг</description>
    </items>
    <items>
      <name>ГарантияВыданная</name>
      <description>Банковская гарантия выданная</description>
    </items>
    <items>
      <name>ВалютноПроцентныйСвоп</name>
      <description>Валютно-процентный своп</description>
    </items>
    <items>
      <name>ВалютныйСвоп</name>
      <description>Валютный своп</description>
    </items>
    <items>
      <name>ВалютныйФорвард</name>
      <description>Валютный форвард</description>
    </items>
    <items>
      <name>ВексельВыданный</name>
      <description>Вексель выданный</description>
    </items>
    <items>
      <name>ВексельПолученный</name>
      <description>Вексель полученный</description>
    </items>
    <items>
      <name>Депозит</name>
      <description>Депозит</description>
    </items>
    <items>
      <name>ДоходныйКоммерческийДоговор</name>
      <description>Доходный коммерческий договор</description>
    </items>
    <items>
      <name>ЗаемВыданный</name>
      <description>Заем выданный</description>
    </items>
    <items>
      <name>ЗаемПолученный</name>
      <description>Заем полученный</description>
    </items>
    <items>
      <name>КредитПолученный</name>
      <description>Кредит полученный</description>
    </items>
    <items>
      <name>МНО</name>
      <description>Минимальный неснижаемый остаток</description>
    </items>
    <items>
      <name>ОблигацияВыпущенная</name>
      <description>Облигация выпущенная</description>
    </items>
    <items>
      <name>ОблигацияКупленная</name>
      <description>Облигация купленная</description>
    </items>
    <items>
      <name>Овердрафт</name>
      <description>Овердрафт</description>
    </items>
    <items>
      <name>РасходныйКоммерческийДоговор</name>
      <description>Расходный коммерческий договор</description>
    </items>
  </predefined>
  <attributes>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансовогоИнструмента</name>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолонкаСекции</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДвижения</name>
    <comment>В зависимости от вида бюджета, либо доход/расход, либо поступление/платеж</comment>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВзаиморасчетов</name>
    <comment>Приход - дебиторская задолженность, расход - кредиторская</comment>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Documents/ВыбытиеВекселей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	ВстраиваниеУХФинансовыеИнструменты.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ВстраиваниеУХФинансовыеИнструменты.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ВстраиваниеУХ.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВыбытиеВекселя.ПогашениеВекселя") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетВзаиморасчетов");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	//[тест]
	ПроверяемыеРеквизиты.Очистить();
	//ФинансовыеИнструментыУХ.ОбработкаПроверкиЗаполнения_СчетаУчета(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ФинансовыеИнструментыУХ.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидОперации) Тогда
		ЭтотОбъект.ВидОперации = ЭтотОбъект.Метаданные().Реквизиты.ВидОперации.ЗначениеЗаполнения;
	КонецЕсли;
	
	ЗаполнитьПараметрыОперацийПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс	
Процедура ЗаполнитьПараметрыОперацийПоУмолчанию() Экспорт
	
	ТаблицаНастроек = РаботаСДоговорамиКонтрагентовУХ.ПараметрыОперацийГрафикаПоУмолчанию(ГруппаОперацийГрафика());
	ЭтотОбъект.ПараметрыОпераций.Загрузить(ТаблицаНастроек);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ГруппаОперацийГрафика()
	
	Возврат ?(ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийВыбытиеВекселя.ПогашениеВекселя,
				Справочники.ОперацииГрафиковДоговоров.ВексельВыданный,
				Справочники.ОперацииГрафиковДоговоров.ВексельПолученный);

КонецФункции
#КонецОбласти

#КонецЕсли
